digit, digit1, digit2 = float(input()), float(input()), float(input())
sum_ = 0
if digit > 0:
    sum_ += digit
if digit1 > 0:
    sum_ += digit1
if digit2 > 0:
    sum_ += digit2
print(sum_)


# 7
# -13
# 4.9
# 11.9


# КОММЕНТАРИЙ: вам надо на стол словарик положить и регулярно в него заглядывать, и я сейчас вовсе не о русско-английском, а о русском толковом — что такое цифра и что такое число — посмотрите уже определения, наконец

# КОММЕНТАРИЙ: следите за величиной отступа в блоках, для Python это имеет большое значение: в Инструкции по подготовке показано, как в Notepad++ настроить отступы


# ИТОГ: очень хорошо — 3/3
